app/controllers/burgers_controller.rb

  def index
    @burgers = Burger.all
---
SELECT "burgers".* FROM "burgers"

  def show
    @burger = Burger.find(params[:id])
---
SELECT  "burgers".* FROM "burgers" WHERE "burgers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]